# SelectFaces Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionUIOptions..::..SelectFaces Property
SelectionUIOptions Class See Also
---
Indicates whether elements can be selected by clicking on the interior of a face.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool SelectFaces { get; set; }
```

Visual Basic
---
```text
Public Property SelectFaces As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SelectFaces {
	bool get ();
	void set (bool value);
}
```

# Remarks
When this setting is false, users must click on an edge or vertex of an element in order to select the corresponding element. When it is true, users may also select elements by clicking on the interior of a face of an element.
# See Also
SelectionUIOptions Class
Autodesk.Revit.UI Namespace